1. form表单有什么作用？有哪些常用的input 标签，分别有什么作用？
form表单可以把用户输入的数据提交到后台保存起来。
input标签：
  - text 插入一个允许用户输入一行文本的框
  - password 插入一个允许用户输入一行密码的框
  - radio 插入一个单选框
  - checkbox 插入一个复选框
  - submit 插入一个提交按钮
  - reset 插入一个重置按钮
  - file 插入一个上传文件按钮
  - hidden 插入一些隐藏信息
2. post 和 get 方式的区别？
  - post：将表单数据直接发送给服务器，没有字数限制（字数限制较为宽松），安全性较好。
  - get：将表单数据加入到URL上发送给服务器，有字数限制，安全性较差。但有一个优点是URL发送了改变，新的页面可以存为书签。
3. 在input里，name 有什么作用？
在服务器中，表单数据是使用key=value的形式保存的，name值就是key值。
4. radio 如何分组?
name值相同的为同一组
5. placeholder 属性有什么作用?
在框内用灰色文本显示placeholder的值，一般用作对用户将要输入信息的提示。
6. type=hidden隐藏域有什么作用? 举例说明
hidden具有很大的安全意义，由于用户在页面上看不到它的特性，它被服务器用来确定表单内容的真假。比如服务器中设置了hidden的值，当服务器收到hidden的值不匹配时，就会认为这个数据不可靠，于是不存入数据库中，保证了数据库的安全和信息的正确。
7. 简单介绍 HTML 表单的用法
  - 先创建form标签，然后在form标签内创建表单
  - 在form标签内创建各种input、select、option标签来完善表单
  - 注意表单中标签的属性name必须有，选择中value值必须有
